---
title: FilteredWorksetIdIterator
classe: Autodesk.Revit.DB.FilteredWorksetIdIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# FilteredWorksetIdIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `WorksetId Current { get; }` | `filteredWorksetIdIterator.Current` | WorksetId |
| `Boolean IsValidObject { get; }` | `filteredWorksetIdIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `filteredWorksetIdIterator.Dispose()` | Void |
| `WorksetId GetCurrent()` | `filteredWorksetIdIterator.GetCurrent()` | WorksetId |
| `Boolean IsDone()` | `filteredWorksetIdIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `filteredWorksetIdIterator.MoveNext()` | Boolean |
| `Void Reset()` | `filteredWorksetIdIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```